RT-Thread-packages/gd32-arm-series/GD32H77x_78x/GD32H77x_78x_standard_peripheral/Include/gd32h77x_78x_sdio.h
/* SDIO_DATALEN */
#define SDIO_DATALEN_DATALEN            BITS(0,24)             /*!< data transfer length */

/* SDIO_DATACTL */
#define SDIO_DATACTL_DATAEN             BIT(0)                 /*!< data transfer enabled bit */
#define SDIO_DATACTL_DATADIR            BIT(1)                 /*!< data transfer direction */
#define SDIO_DATACTL_TRANSMOD           BITS(2,3)              /*!< data transfer mode */
#define SDIO_DATACTL_BLKSZ              BITS(4,7)              /*!< data block size */
#define SDIO_DATACTL_RWEN               BIT(8)                 /*!< read wait mode enabled bit (SD I/O only) */
#define SDIO_DATACTL_RWSTOP             BIT(9)                 /*!< read wait stop (SD I/O only) */
#define SDIO_DATACTL_RWTYPE             BIT(10)                /*!< read wait type (SD I/O only) */
#define SDIO_DATACTL_IOEN               BIT(11)                /*!< SD I/O specific function enable bit (SD I/O only) */
#define SDIO_DATACTL_ACKEN              BIT(12)                /*!< boot acknowledgment enable bit */
#define SDIO_DATACTL_FIFOREST           BIT(13)                /*!< FIFO buffer reset, flush all data */

/* SDIO_STAT */
#define SDIO_STAT_CCRCERR               BIT(0)                 /*!< command response received (CRC check failed) */
#define SDIO_STAT_DTCRCERR              BIT(1)                 /*!< data block sent/received (CRC check failed) */
#define SDIO_STAT_CMDTMOUT              BIT(2)                 /*!< command response timeout */
#define SDIO_STAT_DTTMOUT               BIT(3)                 /*!< data timeout */
#define SDIO_STAT_TXURE                 BIT(4)                 /*!< transmit FIFO underrun error occurs */
#define SDIO_STAT_RXORE                 BIT(5)                 /*!< received FIFO overrun error occurs */
#define SDIO_STAT_CMDRECV               BIT(6)                 /*!< command response received (CRC check passed) */
#define SDIO_STAT_CMDSEND               BIT(7)                 /*!< command sent (no response required) */
#define SDIO_STAT_DTEND                 BIT(8)                 /*!< data end (data counter, SDIO_DATACNT is zero) */
#define SDIO_STAT_DATHOLD               BIT(9)                 /*!< data transfer hold */
#define SDIO_STAT_DTBLKEND              BIT(10)                /*!< data block sent/received (CRC check passed) */
#define SDIO_STAT_DATABOR               BIT(11)                /*!< data transfer aborted by CMD12 */
#define SDIO_STAT_DATSTA                BIT(12)                /*!< data path active state */
#define SDIO_STAT_CMDSTA                BIT(13)                /*!< command path active state */
#define SDIO_STAT_TFH                   BIT(14)                /*!< transmit FIFO is half empty */
#define SDIO_STAT_RFH                   BIT(15)                /*!< receive FIFO is half full */
#define SDIO_STAT_TFF                   BIT(16)                /*!< transmit FIFO is full */
#define SDIO_STAT_RFF                   BIT(17)                /*!< receive FIFO is full */
#define SDIO_STAT_TFE                   BIT(18)                /*!< transmit FIFO is empty */
#define SDIO_STAT_RFE                   BIT(19)                /*!< receive FIFO is empty */
#define SDIO_STAT_DAT0BSY               BIT(20)                /*!< DAT0 line signal keep busy */
#define SDIO_STAT_DAT0BSYEND            BIT(21)                /*!< DAT0 line signal changed from busy to ready */
#define SDIO_STAT_SDIOINT               BIT(22)                /*!< SD I/O interrupt received */
#define SDIO_STAT_ACKFAIL               BIT(23)                /*!< boot acknowledgment received and check fail */
#define SDIO_STAT_ACKTO                 BIT(24)                /*!< boot acknowledgment timeout */
#define SDIO_STAT_VSEND                 BIT(25)                /*!< voltage switch critical timing section end */
#define SDIO_STAT_CLKSTOP               BIT(26)                /*!< SDIO_CLK stopped in voltage switch procedure */
#define SDIO_STAT_IDMERR                BIT(27)                /*!< IDMA transfer error */
#define SDIO_STAT_IDMAEND               BIT(28)                /*!< IDMA transfer end */

/* SDIO_INTC */
#define SDIO_INTC_CCRCERRC              BIT(0)                 /*!< CCRCERR flag clear bit */
#define SDIO_INTC_DTCRCERRC             BIT(1)                 /*!< DTCRCERR flag clear bit */
#define SDIO_INTC_CMDTMOUTC             BIT(2)                 /*!< CMDTMOUT flag clear bit */
#define SDIO_INTC_DTTMOUTC              BIT(3)                 /*!< DTTMOUT flag clear bit */
#define SDIO_INTC_TXUREC                BIT(4)                 /*!< TXURE flag clear bit */
#define SDIO_INTC_RXOREC                BIT(5)                 /*!< RXORE flag clear bit */
#define SDIO_INTC_CMDRECVC              BIT(6)                 /*!< CMDRECV flag clear bit */
#define SDIO_INTC_CMDSENDC              BIT(7)                 /*!< CMDSEND flag clear bit */
#define SDIO_INTC_DTENDC                BIT(8)                 /*!< DTEND flag clear bit */
#define SDIO_INTC_DATHOLDC              BIT(9)                 /*!< DATHOLD flag clear bit */
#define SDIO_INTC_DTBLKENDC             BIT(10)                /*!< DTBLKEND flag clear bit */
#define SDIO_INTC_DATABORC              BIT(11)                /*!< DATABOR flag clear bit */
#define SDIO_INTC_DAT0BSYENDC           BIT(21)                /*!< DAT0BSYEND flag clear bit */
#define SDIO_INTC_SDIOINTC              BIT(22)                /*!< SDIOINT flag clear bit */
#define SDIO_INTC_ACKFAILC              BIT(23)                /*!< ACKFAIL flag clear bit */
#define SDIO_INTC_ACKTOC                BIT(24)                /*!< ACKTO flag clear bit */
#define SDIO_INTC_VSENDC                BIT(25)                /*!< VSEND flag clear bit */
#define SDIO_INTC_CLKSTOPC              BIT(26)                /*!< CLKSTOP flag clear bit */
#define SDIO_INTC_IDMERRC               BIT(27)                /*!< IDMERR flag clear bit */
#define SDIO_INTC_IDMAENDC              BIT(28)                /*!< IDMAEND flag clear bit */

/* SDIO_INTEN */
#define SDIO_INTEN_CCRCERRIE            BIT(0)                 /*!< command response CRC fail interrupt enable */
#define SDIO_INTEN_DTCRCERRIE           BIT(1)                 /*!< data CRC fail interrupt enable */
#define SDIO_INTEN_CMDTMOUTIE           BIT(2)                 /*!< command response timeout interrupt enable */
#define SDIO_INTEN_DTTMOUTIE            BIT(3)                 /*!< data timeout interrupt enable */
#define SDIO_INTEN_TXUREIE              BIT(4)                 /*!< transmit FIFO underrun error interrupt enable */
#define SDIO_INTEN_RXOREIE              BIT(5)                 /*!< received FIFO overrun error interrupt enable */
#define SDIO_INTEN_CMDRECVIE            BIT(6)                 /*!< command response received interrupt enable */
#define SDIO_INTEN_CMDSENDIE            BIT(7)                 /*!< command sent interrupt enable */
#define SDIO_INTEN_DTENDIE              BIT(8)                 /*!< data end interrupt enable */
#define SDIO_INTEN_DATHOLDIE            BIT(9)                 /*!< data transfer hold interrupt enable */
#define SDIO_INTEN_DTBLKENDIE           BIT(10)                /*!< data block end interrupt enable */
#define SDIO_INTEN_DATABORIE            BIT(11)                /*!< data transfer abort interrupt enable */
#define SDIO_INTEN_TFHIE                BIT(14)                /*!< transmit FIFO half empty interrupt enable */
#define SDIO_INTEN_RFHIE                BIT(15)                /*!< receive FIFO half full interrupt enable */
#define SDIO_INTEN_RFFIE                BIT(17)                /*!< receive FIFO full interrupt enable */
#define SDIO_INTEN_TFEIE                BIT(18)                /*!< transmit FIFO empty interrupt enable */
#define SDIO_INTEN_DAT0BSYENDIE         BIT(21)                /*!< DAT0 line signal changed from busy to ready interrupt enable */
#define SDIO_INTEN_SDIOINTIE            BIT(22)                /*!< SD I/O interrupt received interrupt enable */
#define SDIO_INTEN_ACKFAILIE            BIT(23)                /*!< boot acknowledgment received and check fail interrupt enable */
#define SDIO_INTEN_ACKTOIE              BIT(24)                /*!< boot acknowledgment timeout enable */
#define SDIO_INTEN_VSENDIE              BIT(25)                /*!< voltage switch critical timing section end interrupt enable */
#define SDIO_INTEN_CLKSTOPIE            BIT(26)                /*!< voltage Switch clock stopped interrupt enable */
#define SDIO_INTEN_IDMAERRIE            BIT(27)                /*!< IDMA transfer error interrupt enable */
#define SDIO_INTEN_IDMAENDIE            BIT(28)                /*!< IDMA transfer end interrupt enable */

/* SDIO_ACKTO */
#define SDIO_ACKTO_ACKTO                BITS(0, 24)            /*!< boot ACK timeout period */

/* SDIO_FIFO */
#define SDIO_FIFO_FIFODT                BITS(0, 31)            /*!< receive FIFO data or transmit FIFO data */

/* SDIO_IDMACTL */
#define SDIO_IDMACTL_IDMAEN             BIT(0)                 /*!< FIFO IDMA enable bit */
#define SDIO_IDMACTL_BUFMOD             BIT(1)                 /*!< double buffer mode enable bit */
#define SDIO_IDMACTL_BUFSEL             BIT(2)                 /*!< IDMA double buffer selection bit */

/* SDIO_IDMASIZE */
#define SDIO_IDMASIZE_IDMASIZE          BITS(5, 12)            /*!< number of bytes per buffer, buffer size = number*32 */

/* SDIO_IDMAADDR0 */
#define SDIO_IDMAADDR0_IDMAADDR0        BITS(0, 31)            /*!< IDMA buffer 0 base address, is a multiple of 8 */

/* SDIO_IDMAADDR1 */
#define SDIO_IDMAADDR1_IDMAADDR1        BITS(0, 31)            /*!< IDMA buffer 1 base address, is a multiple of 8 */

/* constants definitions */
/* SDIO power control */
#define PWRCTL_PWRCTL(regval)           (BITS(0,1) & ((uint32_t)(regval) << 0))
#define SDIO_POWER_OFF                  PWRCTL_PWRCTL(0)       /*!< SDIO power off */
#define SDIO_POWER_CYCLE                PWRCTL_PWRCTL(2)       /*!< SDIO power cycle */
#define SDIO_POWER_ON                   PWRCTL_PWRCTL(3)       /*!< SDIO power on */

